export default {
  add: 'Добавить администратора',
  add_description: 'Укажите данные для добавления администратора',
  email: 'Email',
  permissions: 'Права',
  permission: {
    admin: 'Администратор',
    read: 'Просмотр конференции (если скрыта)',
    write: 'Редактирование настроек конференции',
    read_hidden_pages: 'Просмотр скрытых страниц конференции',
    write_pages: 'Редактирование страниц конференции',
    read_conf_app: 'Просмотр заявок в конференции',
    accept_conf_app: 'Принимать заявки в конференции',
    create_conf_app: 'Создание заявок в конференции',
    read_date_conf_app: 'Просмотр даты/времени выступления',
    edit_date_conf_app: 'Редактирование даты/времени выступления',
    read_content_conf_app: 'Просмотр контента заявки',
    edit_content_conf_app: 'Редактирование контента заявки',
  },
  delete: 'Удалить'
}